# Section Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralElementDefinitionData..::..Section Property
StructuralElementDefinitionData Class See Also
---
Structural section of the element.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public StructuralSection Section { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Section As StructuralSection
	Get
```

Visual C++
---
```text
public:
property StructuralSection^ Section {
	StructuralSection^ get ();
}
```

# See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace